<img src = "https://faithmag.com/sites/default/files/styles/article_full/public/2018-09/titanic2.jpg?h=6521bd5e&itok=H8td6QVv">

# <font>The Titanic Dataset</font>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#################import other libraries you might need#################
df = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# clean the data

In [5]:
# check the nulls in the data
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age              0
dtype: int64

In [4]:
# if there are nulls, consider filling the missing values with column mean or median
df['Age ']=df.Age.fillna(df.Age.mean())

# data exploration and summaries

In [5]:
# get the data summary for the data

In [6]:
# how many people survived  -  how many died?

In [7]:
# What was teh percentage of men and women in the data? ( create a pie chart)

In [8]:
# what was the median Age(Make a box plot)
# make a boxplot for men and women seperately and comment on which gender has the higher median Age

In [9]:
# on average which gender paid the gighest median Fare?

In [ ]:
# Bill burr said that women had a higher chance of survival? is this true?

In [ ]:
# which persanger class survived more and which died more?  -  also make an appropriate plot for this

In [ ]:
# what was the average fare paid by each Survival class?

In [10]:
# Having analyzed this data: is it true to say that if you were a woman who paid.../
#alot of money on first class tickets you would have a higher chance of survival?

# Machine learning

In [6]:
dx = df.drop(["Name","Survived","Ticket","Cabin","Sex","Embarked","PassengerId"],1)
factors = ["Sex","Embarked"]

In [8]:
dx.head()

   Pclass   Age  SibSp  Parch     Fare  Age
0       3  22.0      1      0   7.2500  22.0
1       1  38.0      1      0  71.2833  38.0
2       3  26.0      0      0   7.9250  26.0
3       1  35.0      1      0  53.1000  35.0
4       3  35.0      0      0   8.0500  35.0

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0

In [11]:
# split the data into x and y with y 
x# is the numeric columns
y# is the survived class ( we want to predict whether someone survived given the numeric characteristics)

NameError: name 'x' is not defined

In [12]:
# do a train test split

In [13]:
# Initialize a machine learning model and train it ( use logistic -  this is a classification problem)
# even if the Y seems numeric, it has few numbers therefore they are taken as classes

In [14]:
# test the model a ccuracy

In [15]:
# generate a dummy person data and see if the model can predict this person ( this person should be an np array)

# Extra credit problem/

In [ ]:
# you can also use the non numeric columns in the data as part of the X through converting them to numeric using dummy variables
# include a dummy variable for sex in your X and repeat the ML process ( did the model imporve?)#
# there is a class of models that can be used for machine learning called ensemble models such as Random Forest - try an RF classifier
# did your model improve?
# you could use a Confusion Matrix to test model performance?
# did you manage?